app/Controllers/Api/EmployeeController.php

        unset($data['designation']); // we’ll store only role flags

        // Insert employee
        $insertID = $employeeModel->insert($data);
---
INSERT INTO `employee` (`name`, `mobile_no`, `email`, `gender`, `password`, `is_admin`, `is_doctor`, `is_receptionist`, `is_staff`) VALUES ('ayesha tayyab Azeemi', '03361213999', 'ayeshatayyab027@gmail.com', 'female', '$2y$10$M4L.oKRi8H5lD4iBW6FYHeCWlxy0r9XNsSubTguprAHihA0ardVZi', 0, 1, 0, 0)