app/Controllers/Login.php

SELECT *
FROM `employee`
WHERE `email` = 'admin@example.com'
 LIMIT 1
---
    public function auth()
{
    helper(['url','form']);
    $postData = $this->request->getPost();
    log_message('debug', 'Login form posted: ' . print_r($postData, true));

    $validation = \Config\Services::validation();
    $validation->setRules([
        'username' => 'required|valid_email',
        'password' => 'required',
        'role'     => 'required'  // ensure role is selected
    ]);

    if (! $validation->withRequest($this->request)->run()) {
        return $this->response->setJSON([
            'success' => false,
            'message' => $validation->getError('username')
                         ?? $validation->getError('password')
                         ?? $validation->getError('role')
        ]);
    }

    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');
    $selectedRole = $this->request->getPost('role');

    $employeeModel = new \App\Models\EmployeeModel();
    $employee = $employeeModel->where('email', $username)->first();