app/Controllers/PatientProfile.php

SELECT *
FROM `patients`
WHERE `patients`.`patient_id` = '16'
---
    public function view($id = null)
    {
        if ($id === null) return redirect()->to('/adminDashboard');

        $model = new PatientModel();
        $patient = $model->find($id);

        if (!$patient) {
            return redirect()->to('/adminDashboard')->with('error','Patient not found');